Revit 2027 API
ExporterIFCUtils.GetRelativeLocalPlacementOffsetTransform Method
 Obtains the relative transform between two IfcLocalPlacement handles.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Transform GetRelativeLocalPlacementOffsetTransform(
	IFCAnyHandle originalPlacement,
	IFCAnyHandle relativePlacement
)
Public Shared Function GetRelativeLocalPlacementOffsetTransform (
	originalPlacement As IFCAnyHandle,
	relativePlacement As IFCAnyHandle
) As Transform
public:
static Transform^ GetRelativeLocalPlacementOffsetTransform(
	IFCAnyHandle^ originalPlacement,
	IFCAnyHandle^ relativePlacement
)
static member GetRelativeLocalPlacementOffsetTransform :
        originalPlacement : IFCAnyHandle *
        relativePlacement : IFCAnyHandle -> Transform
Parameters
originalPlacement IFCAnyHandle
 The original placement from which the result transforms coordinates and directions.
relativePlacement IFCAnyHandle
 The relative placement to which the result transforms coordinates and directions.
Return Value
Transform
 The transform from the original placement to the new placement.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace